export const loginErrors = {
  "Отсутствует токен":
    "При авторизации произошла ошибка. Токен не передан или передан не в том формате.",
  "Неудачная авторизация":
    "При авторизации произошла ошибка. Переданный токен некорректен",
  "Неверный Email": "Вы ввели неправильный логин",
  "Неправильный пароль": "Вы ввели неправильный пароль. ",
  "Validation failed":
    "При авторизации пользователя произошла ошибка.",
};

export const registerErrors = {
  "Пользователь с таким Email уже существует":
    "Пользователь с таким Email уже существует",
  "Validation failed":
    "При регистрации пользователя произошла ошибка.",
};

export const profileErrors = {
  "Пользователь с таким Email уже существует":
    "Пользователь с таким Email уже существует",
  "Validation failed": "При обновлении профиля произошла ошибка.",
};
